{"pageProps":{"postData":{"id":"popularity-metrics","contentHtml":"<p>One intuition that we've had since the start of the Pith project is that when designing the space, <em>popularity metrics should be avoided</em>. As the project has progressed we've found that a surprising number of common affordances in digital social spaces can be framed as popularity metrics. Plenty of these affordances can be both functional and delightful to use, which has forced the question of <em>why</em> we're really trying to avoid popularity metrics.</p>\n<p>The idea started as an intuition and will remain that throughout this article. I <em>don't</em> want to include academic studies or research under the guise of there being some sort of compelling statistical evidence that popularity metrics are detrimental in some way. In the coming months we'll be testing affordances in discussion spaces that aim to sort this question out more rigorously in the context of our own system. For now though, I <em>do</em> want to elaborate on the intuition in a way that tries to codify some of the ways popularity metrics are used and their implications, from my perspective at least.</p>\n<p>There are two main ways that popularity metrics manifest in digital systems:</p>\n<ol>\n<li>Algorithmically. More popular content is more likely to be shown to someone, or a core part of the system allows for browsing this content. This can mean content that is \"engaging\", \"controversial\", \"most talked about\", \"hot\", and so on.</li>\n<li>Functionally. A part of the system that the user interacts with is used to support the algorithmic portion of the system. Examples include \"likes\", \"up/downvotes\", \"retweets\", \"shares\", and so on.</li>\n</ol>\n<p>These two pieces often fit together so seamlessly in systems that they become a core part of how someone interacts with it. Upvotes are one very essential metric used by Reddit to determine what appears in someone's feed. That means people have to upvote content, which Reddit makes easy to do. The upvote becomes tied to Reddit's identity and how you're expected to engage with the platform. The same is true for the \"like\" button that dominates Facebook and Instagram. As are views on YouTube. Almost every platform that supports social interaction online has some piece of functionality that allows people to give feedback about what they think about something, which is then used in the calculation of if that content should be shown to others.</p>\n<p>But why? Why is this such a standard design pattern? I'd say it's probably because it works. People <em>want</em> to see things that are more \"engaging\" or \"interesting\"; content that's been verified as being worth their time by others. So if the end goal is to keep someone on your app or website, of course it makes sense to make sure they stay engaged with the <em>juiciest</em>, <em>sickest</em>, most <em>shocking</em> content you've got.</p>\n<p>Sure, I want to see what's popular sometimes too. Everyone does. Popularity metrics can be a very effective way of pre-sorting a large quantity of unknown content into a smaller set that's more likely to have qualities that people will appreciate. But therein lies the real problem. Everyone appreciates different things, and you can't <em>know</em> what those things are ahead of time. Even <em>I</em> can't really predict what I'll find interesting sometimes.</p>\n<p>The solution to this problem—as decided by most social platforms—is to push all the things someone has \"liked\" through a series of machine learning models which can then be used to predict if that person will like some new content. This answer is Zuck's favorite: to \"build sophisticated AI tools\". To be fair to Facebook and the others, of course this is the answer. If the basis of your system is a series of popularity metrics, then you have a lot of data about what every user of your system has liked. So obviously the solution is to build machine learning models. It's that or changing the fundamental way the system works. The choice to go the machine learning route makes a lot of sense.</p>\n<p>Again, I think popularity metrics can be an effective way of sorting content. The question is more what the end goal of the system is; why do you need to sort the content, and what is the content? If the goal is to support exploration and productive discussion—our goal—popularity isn't a particularly good way of sorting content. In designing the system, it's a better idea to find the underlying motivation someone has for taking some action, and then to <em>design affordances that allow for them to make that action in the purest sense of what the action is</em>. Maybe there are times when explicitly introducing a popularity metric through something like a poll makes sense, but only insofar as the goal of the poll is to uncover what is and is not popular. If someone wants to know that others have seen their message, the affordance that's designed for this purpose should try to serve this goal and this goal only. A solution such as a \"like\" button introduces a lot of complexity beyond what the person making the post <em>really wanted in the first place</em>.</p>\n<p>So, the intuition to avoid popularity metrics mostly stems from the abundant staleness of existing designs and their familiar, predictable problems. Of course, I haven't talked at all about the psychological impacts of these metrics. But that subject has been explored <em>ad nauseam</em> elsewhere, and I think we have very keen sense for the problems there. Perhaps there's something about social technology and people that the tend towards vapid sensationalism and fetishizing popularity is inevitable. I certainly don't want that to be the truth, so creating and testing alternative approaches seems like a reasonable approach.</p>\n","title":"The Intuition to Avoid Popularity Metrics","date":"2020-12-29","author":"Christian Broms","summary":"One intuition that we've had since the start of the Pith project is that when designing the space, popularity metrics should be avoided. As the project has progressed we've found that a surprising number of common affordances in digital social spaces can be framed as popularity metrics. Plenty of these affordances can be both functional and delightful to use, which has forced the question of why we're really trying to avoid popularity metrics"}},"__N_SSG":true}