{"pageProps":{"postData":{"id":"piths-future","contentHtml":"<h2>Testing and listening mechanics</h2>\n<p><em>You can also read <a href=\"/files/pith_capstone.pdf\">the presentation</a> outlining our work testing Pith.</em></p>\n<p>For most of April and a bit of early May we worked on running a series of tests of Pith with Prolific and iteratively making design changes. We wanted to focus on changes that would be most impactful and that emerged from people’s use of the system. We split up the tests so each group saw slightly different variations of the interface, some with just a chat, and others with a chat and summary.</p>\n<p>From a few initial runs, it seemed clear that there were a few potential areas that we could focus or design efforts on, the most interesting of which being a <em>listening mechanic</em>. We found that people weren’t always being listened to by others in the group and sometimes felt that their contributions were being passed over. This was measured from subjective reports such as <em>“I felt like none of my suggestions were being listened to, and I wanted to show that I had some suggestions.”</em> and also in overall group means for responses to the statement “I feel the group listened to my contributions.” (1 not at all - 5 all the time), which hovered between 3-4.</p>\n<p>We introduced a mechanic called “flairing” to try and address this issue, so people could attach a kind of tag to their messages to better identify it as a question, suggestion, or meta discussion point. This didn’t really change the “feeling heard” scores, but when one or two people started using the flairs it created a sort of a culture where others would also use the flairs. This was promising as it seemed to indicate that if we could find a way to make flairs something that <em>had to be acknowledged</em>, then this could create a <em>culture</em> where people listened more.</p>\n<p>The summary offered the potential we needed. It was a space that we observed worked best for groups when it was organized; a more organized summary meant that everyone was on the same page at the end of the discussion and could therefore better answer the questions at the end of the task and get the bonus for the task we prepared. People realized this and made sure that it contained only the most relevant information so others wouldn’t be confused. There was a strong <em>incentive</em> to keep this space clean.</p>\n<p>Our two small changes were to make flairs automatically add the message to the summary <em>and</em> to show which individual removed each message from the summary. This created a situation where people wanted to keep the summary clean by unpinning messages, but could not do so without first acknowledging them in the chat <em>or else they would look rude to their peers</em>. As a result we were able to create a <em>culture</em> where people responded more to others’ suggestions. The reports of not feeling heard disappeared and the overall “feeling heard” score increased by about 1-1.5. It’s certainly a compelling result in that we were able to make a couple of very small changes and see some kind of larger change to the social dynamics of the group in a positive way. \nMore broadly, this result indicates that the social landscape that emerges through a digital space can be cultivated and nourished through well-considered changes to the design of the space. We were able to change the social conditions within groups of totally random, unfamiliar, and anonymous people online for the better. The many negative effects of social platforms only exist as a result of these platforms’ design—polarization, trolling, posturing, talking past one another, “cancelling”, and so on <em>can be changed, reduced, or eliminated with adjustments to the design of these digital spaces</em>.</p>\n<h2>Pith’s future</h2>\n<p>Pith was the capstone project for my undergraduate degree (Cognitive Science and Art) and the thesis for undergraduate degree (Computer Science) at Carnegie Mellon University. We’ve both now graduated and as a result this project will most certainly take a different form in the future. Some of our decisions were made as a result of the requirements our programs imposed, which meant that in many ways Pith shifted in a particular direction that we weren’t initially expecting. Not a bad direction, just more focused than we had initially intended. This was beneficial in that it allowed us to perform more rigorous testing through an extremely generous grant we received, and as a result uncover excellent insights about our system and social behavior more broadly. However, it limited some of the quick and more experimental development we had initially planned, which is where Pith will likely go in the future. Pith will probably not be a “product“ (for a long time, at least), but rather a canvas we can use for more experimentation. Our final codebase has been built to be as clean and understandable as possible so it can be easily built on top of and adjusted.</p>\n<p>We’ll be taking a break working on Pith for at least six months or so—after which we’ll come back and decide what feels most natural to continue to build on. There’s still a ton of potential to explore and learn from while designing online discussion spaces, it’s just a matter of looking outwards and choosing an area of focus and designing to fit on the foundation we’ve already constructed.</p>\n","title":"A Listening Mechanic and The Future","date":"2021-06-01","author":"Christian Broms","summary":"For most of April and a bit of early May we worked on running a series of tests of Pith with Prolific and iteratively making design changes. We wanted to focus on changes that would be most impactful and that emerged from people’s use of the system."}},"__N_SSG":true}