{"pageProps":{"postData":{"id":"mid-fidelity","contentHtml":"<p>We'd like to share the latest medium fidelity mockups of our alpha prototype, which lays out the framework for a small group of people to have an organized discussion. We designed the framework to be extensible to the beta prototype, which organizes discussion for a large group of people.</p>\n<p>The screen is divided into two main parts, the left half being a chat-like space and the right half being an organizational space, a document.</p>\n<p><img src=\"/images/mid-fidelity/full.png\"></p>\n<h2>The document</h2>\n<p>The document space is essentially a recursive bullet-list structure in the vein of <a href=\"https://roamresearch.com/\">Roam Research</a> or <a href=\"https://workflowy.com/\">Workflowly</a>. A bullet point serves as both content for its parent bullet point and as the section header for its children bullet. We call the text in each point <em>piths</em> because we imagine the text should capture the essence of the point's children or an idea. Our term for a bullet point is a <em>unit</em>, which includes the pith and a list of child units, creating the recursive structure. </p>\n<p>The purpose of the organizational space is to capture the most salient parts of the conversation for the members as they discuss. This not only helps them expand upon the most important points <em>during</em> the discussion, but also remember their points <em>after</em> the discussion. </p>\n<p>To do this, the document serves as a space for the members to track points considered worthwhile. Generally, the members might want to be talking about the same subject. They can create a unit in the document for their topic, i.e. \"Whales\". Each member has a special \"cursor\" they can set to any place in the document, such as under the unit for \"Whales\". As the members continue generating units related to this topic, they can copy over units from the discussion pace to under their cursor. After some time, the \"Whales\" point will be full of units deemed important. </p>\n<p><img src=\"/images/mid-fidelity/document.png\"></p>\n<p>In case a person gets lost trying to make points far away from the main discussion within the document (maybe they are layers deep in some point), they can see where the other members are. There is an icon for each member at the top of the document section. If they hover over another's icon, they will momentarily see where that person's cursor is. If they then click on the icon, their cursor will be in the exact same place as the other person's cursor.</p>\n<p><img src=\"/images/mid-fidelity/cursor.png\"></p>\n<p>They can also view different parts of the document without moving their cursor. If they want to see where their cursor is, they can click on their own icon.</p>\n<p>Each member also has a timeline of the units they've visited. This timeline is placed vertically to the right of the document section. Through this timeline, they can see under which units they have made changes. For example, a person could be making most of their changes under \"Whales\". They will see a long, thick line for \"Whales\". Maybe after that they edited some units under \"Apples\", and just after, units for \"Monkeys\", then \"Flounder\". There will be a much smaller line for \"Apples\", then \"Monkeys\", then \"Flounder\" on the timeline. Through this mechanic, they can see under which units they have spent significant time on and get a temporal sense for the main points they thought about throughout the discussion. Clicking on a part of the timeline will send the user to the unit visited at that point in time.</p>\n<p><img src=\"/images/mid-fidelity/timeline.png\"></p>\n<p>We've elected to create \"locks\" on content to prevent concurrency related issues. Only one user at a time can edit or move any given unit. </p>\n<p><img src=\"/images/mid-fidelity/lock.png\"></p>\n<h2>The discussion</h2>\n<p>For the discussion space, we're mostly keeping the design we've been working with for the past few months: </p>\n<p><img src=\"/images/mid-fidelity/current.png\"></p>\n<p>One change is that we've removed tags. We found their purpose to be a bit unclear in practice, especially as we've moved away from the tag-based network. That said, we'll likely experiment with adding these back in the future, perhaps in the form of the ubiquitous \"emoji reaction\". Just kidding. 😉</p>\n<p>Our post/block model has transformed so that each block, now a unit, is separate from other units. However, a unit can still \"link\" to other units. These links are displayed as double-arrows with a reference number. The text of the linked units is transcluded on top of the main unit.</p>\n<p><img src=\"/images/mid-fidelity/transclusion.png\"></p>\n<p>Finally, we've designed the a new search mechanic that allows for greater control over the search process. Typing \">\" starts an inline search, which opens the search panel directly above the editor. The search is wrapped by the \">\" and closing \"&#x3C;\". The discussion itself is preserved above the editor. In addition to using the options presented in the query space, people can scroll through the discussion and choose blocks to link to where the cursor is.</p>\n<p><img src=\"/images/mid-fidelity/query.png\"></p>\n<h2>Mobile</h2>\n<p>Yes, mobile is also in the works. The two panels of discussion and document are separated into tabs.</p>\n<p><img src=\"/images/mid-fidelity/mobile.png\"></p>\n","title":"Alpha prototype mid-fidelity mockups","date":"2020-09-27","author":"Christian Broms and Sydney Zheng","summary":"We'd like to share the latest medium fidelity mockups of our alpha prototype, which lays out the framework for a small group of people to have an organized discussion. We designed the framework to be extensible to the beta prototype, which organizes discussion for a large group of people."}},"__N_SSG":true}