{"pageProps":{"postData":{"id":"building-it","contentHtml":"<p>Much of the focus of the Pith blog has been about <em>why</em> we're designing the system and what we're considering while doing so. We've yet to discuss much about <em>how</em> we're building Pith, specifically the technologies we're using and architecture of the system. This post will outline our current approach and rationale. </p>\n<h2>The system architecture</h2>\n<p>At the most basic level, Pith has two components: a web-based client interface and a server that handles coordinating multiple clients. </p>\n<h3>Client</h3>\n<p>We've opted for having the client handle the UI display logic as a standalone <a href=\"https://reactjs.org/\">React</a> / <a href=\"https://redux.js.org/\">Redux</a> project as opposed to server-rendered pages (such as with <a href=\"https://nextjs.org/\">Next.js</a> or <a href=\"https://www.djangoproject.com/\">Django</a>) because we want the server to be generalizable to different client implementations. We see the UI as a flexible and extensible component that sits on top of the core Pith structure and could take many different forms. The web app that we're designing could be extended, remixed, or completely replaced and Pith's core functionality would remain unchanged. </p>\n<h3>Communication</h3>\n<p>Given Pith is a place for realtime discussion, we needed to build the system a bit like <a href=\"https://en.wikipedia.org/wiki/Internet_Relay_Chat\">IRC</a> with updates automatically pushed to the clients by the server. For websites, this functionality can be implemented using <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/WebSockets_API\">websockets</a>. We're using the <a href=\"https://socket.io/\">socket.io</a> library because it's easy to use and provides all the functionality we need with its <a href=\"https://socket.io/docs/rooms/\">rooms</a> and <a href=\"https://socket.io/docs/namespaces/\">namespaces</a>. </p>\n<h3>Server</h3>\n<p>Rather than use the official Node.js server library for <a href=\"http://socket.io\">socket.io</a>, we have opted to use the community built and maintained <a href=\"https://python-socketio.readthedocs.io/en/latest/\">python-socketio</a> library for two main reasons. First, we're more comfortable with Python as a language, and second, when it comes to implementing the network, reliable and well documented packages like <a href=\"https://www.nltk.org/\">nltk</a>, <a href=\"https://networkx.github.io/\">networkx</a>, and <a href=\"https://graph-tool.skewed.de/\">graph-tool</a> will make development simpler than finding javascript equivalents. </p>\n<p>The server is composed of a number of smaller services:</p>\n<ul>\n<li><code>app</code>: the socketio interface that's used by <a href=\"https://github.com/rainflame/pith-client\">the React client</a>.</li>\n<li><code>worker</code>: a worker script using the <a href=\"https://github.com/samuelcolvin/arq\">arq task queue</a> for executing assorted long-term tasks such as archiving discussions when they're complete.</li>\n<li><code>redis</code>: a Redis database used by the task queue (<code>worker</code>) and as a message queue by socketio (<code>app</code>).</li>\n<li><code>mongo</code>: the MongoDB database used to store the discussion content.</li>\n</ul>\n<p>We use docker and docker compose for orchestrating building and running each of these services in containers. You can read more about this process in <a href=\"https://github.com/rainflame/pith-api/blob/master/README.md\">the project's readme file</a>. </p>\n<h3>Managers</h3>\n<p>The <code>app</code> specifies the <a href=\"https://pith-api.readthedocs.io/en/latest/app.html\">API</a> the frontend uses. However, the functions within <code>app</code> only handle the parsing and validation of requests and the proper return or emit of the response. The actual logic of the function is encapsulated in a managing-function called between request handling and response handling. These managing functions reside in manager classes. Currently, we have a manager for any logic surrounding the discussion abstraction. We are also planning on making a manager for logic surrounding the board abstraction and one for the user abstraction.</p>\n","title":"How we're building it","date":"2020-09-08","author":"Christian Broms and Sydney Zheng","summary":"Much of the focus of the Pith blog has been about why we're designing the system and what we're considering while doing so. We've yet to discuss much about how we're building Pith, specifically the technologies we're using and architecture of the system."}},"__N_SSG":true}